In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("C:\\Users\\Welcome\\Downloads\\ds_salaries.csv")

In [3]:
df.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [4]:
#mean
df.mean()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_6632\3545338122.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

work_year          2022.373635
salary           190695.571771
salary_in_usd    137570.389880
remote_ratio         46.271638
dtype: float64

In [5]:
df.loc[:,'salary'].mean()

190695.57177097205

In [6]:
df.mean(axis=1)[0:4]

C:\Users\Welcome\AppData\Local\Temp\ipykernel_6632\1148177455.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)[0:4]

0    41992.50
1    15530.75
2    13280.75
3    88030.75
dtype: float64

In [7]:
#median
df.median()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_6632\1739800283.py:2: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

work_year          2022.0
salary           138000.0
salary_in_usd    135000.0
remote_ratio          0.0
dtype: float64

In [8]:
df.loc[:,'salary'].median()

138000.0

In [9]:
df.median(axis=1)[0:4]

C:\Users\Welcome\AppData\Local\Temp\ipykernel_6632\381455229.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median(axis=1)[0:4]

0    41011.5
1    16011.5
2    13761.5
3    88511.5
dtype: float64

In [10]:
#mode
df.mode()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Data Engineer,100000,USD,100000,US,0,US,M

In [11]:
df.loc[:,'salary'].mode()

0    100000
Name: salary, dtype: int64

In [12]:
#minimum
df.min()

work_year                                      2020
experience_level                                 EN
employment_type                                  CT
job_title             3D Computer Vision Researcher
salary                                         6000
salary_currency                                 AUD
salary_in_usd                                  5132
employee_residence                               AE
remote_ratio                                      0
company_location                                 AE
company_size                                      L
dtype: object

In [14]:
df.loc[:,'salary'].min(skipna=False)

6000

In [15]:
#maximum
df.max()

work_year                             2023
experience_level                        SE
employment_type                         PT
job_title             Staff Data Scientist
salary                            30400000
salary_currency                        USD
salary_in_usd                       450000
employee_residence                      VN
remote_ratio                           100
company_location                        VN
company_size                             S
dtype: object

In [16]:
df.loc[:,'salary'].max(skipna = False)

30400000

In [17]:
#standard deviation
df.std()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_6632\2857106541.py:2: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

work_year             0.691448
salary           671676.500508
salary_in_usd     63055.625278
remote_ratio         48.589050
dtype: float64

In [18]:
df.loc[:,'salary'].std()

671676.5005079071

In [19]:
# one hot encoding
from sklearn import preprocessing
enc = preprocessing.OneHotEncoder()
enc_df = pd.DataFrame(enc.fit_transform(df[['employment_type']]).toarray())
enc_df

        0    1    2    3
0     0.0  0.0  1.0  0.0
1     1.0  0.0  0.0  0.0
2     1.0  0.0  0.0  0.0
3     0.0  0.0  1.0  0.0
4     0.0  0.0  1.0  0.0
...   ...  ...  ...  ...
3750  0.0  0.0  1.0  0.0
3751  0.0  0.0  1.0  0.0
3752  0.0  0.0  1.0  0.0
3753  1.0  0.0  0.0  0.0
3754  0.0  0.0  1.0  0.0

[3755 rows x 4 columns]

In [21]:
df_encode =df.join(enc_df)
df_encode

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,0,1,2,3
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L,0.0,0.0,1.0,0.0
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S,1.0,0.0,0.0,0.0
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S,1.0,0.0,0.0,0.0
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M,0.0,0.0,1.0,0.0
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M,0.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L,0.0,0.0,1.0,0.0
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L,0.0,0.0,1.0,0.0
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S,0.0,0.0,1.0,0.0
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L,1.0,0.0,0.0,0.0
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L,0.0,0.0,1.0,0.0